#INTRO TO IT 2nd COURSE
# Задача 4: Найди сумму!
# Можешь найти сумму всех чисел в списке?
def summa_all(num):
    return sum(num)
num = [1, 2, 3, 4, 5]
print(f"Сумма {num} равна {summa_all(num)}")